izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/display_thread.cpp
#include "display_thread.h"
#include "m202md28a.h"
#include "preferences.h"
#include <stdio.h>
#include <time.h>

#define LINE1_START_X 2
#define LINE1_LEN 18

#define LINE2_START_X 0
#define LINE2_LEN 20

#define STATEICON_X 0
#define STATEICON_Y 0
#define STATEICON_FILL 2
#define STATEICON_STOP "\x80"
#define STATEICON_PLAY "\x81"
#define STATEICON_PAUSE "\x82"
#define STATEICON_LOAD "\x83"

#define VOLUME_START_X 0
#define VOLUME_START_Y 1
#define VOLUME_LEN 20
#define VOLUME_LINE_SIZE VOLUME_LEN

#define SCROLL_DEFAULT_SPEED 300
#define SCROLL_LINE1_SIZE LINE1_LEN

#define FFT_SIZE 1024 /* 对于双声道，每声道占用一半，对于单声道也是占用一半，但是两声道数据相同 */

/* https://github.com/reupen/columns_ui/blob/master/foo_ui_columns/vis_spectrum.cpp */
t_size g_scale_value_single(double val, t_size count, bool b_log)
{
	double val_trans;
	if (b_log) {
		constexpr auto minimum_value = -4;
		double log_val = val > 0 ? log10(val) : minimum_value;
		if (log_val < minimum_value)
			log_val = minimum_value;
		val_trans = count * (log_val + -minimum_value) / -minimum_value;
	}
	else {
		double start = (double)count * val;
		val_trans = start;
	}
	t_size ret = pfc::rint32(val_trans);
	ret = max(min(ret, count), 0);
	return ret;
}

DWORD WINAPI main_display_thread(LPVOID lpParamter)
{
	hid_device* hid;
	DisplayThreadData* thread_data;
	PlayInfo* play_info;
	clock_t start_clock, end_clock;
	uint16_t code_exec_time;
	bool disable_display;

	uint32_t i, j;

	char scroll_str[(SCROLL_LINE1_SIZE + 1) * 3];
	uint16_t scroll_delay_count;
	uint16_t scroll_delay_move;
	int32_t scroll_pos;

	char volume_str[(VOLUME_LINE_SIZE + 1) * 3];
	int32_t volume_delay_count;

	service_ptr_t<visualisation_stream_v3> visualisation_stream_ptr;
	static_api_ptr_t<visualisation_manager> visualisation_manager_ptr;
	double abs_time;
	audio_chunk_impl spectrum_chunk;
	double spectrum_visual_data[FFT_SIZE / 2];
	char spectrum_display_char_old[21];
	char spectrum_display_char[21];

	uint16_t spectrum_get_delay;
	uint16_t spectrum_display_delay;

	thread_data = (DisplayThreadData*)lpParamter;
	play_info = &thread_data->play_info;
	hid = display_init(thread_data->vid, thread_data->pid);
	if (hid != NULL)
	{
		thread_data->status = 1;
	}
	else
	{
		thread_data->status = -1;
		return -1;
	}

	display_load_default_setting(hid);
	display_set_cp_utf8(hid);

	scroll_delay_count = 0;
	scroll_delay_move = 0;
	scroll_pos = SCROLL_LINE1_SIZE - 1;
	code_exec_time = 0;

	play_info->update_play_state = true; /* 强制更新一次显示 */
	play_info->play_state = PLAY_STATE_STOP;
	disable_display = false;
	memset(scroll_str, '\0', sizeof(scroll_str));
	volume_delay_count = 0;

	visualisation_manager_ptr->create_stream(visualisation_stream_ptr, visualisation_manager::KStreamFlagNewFFT);

	memset(spectrum_display_char, 0x9F, sizeof(spectrum_display_char));
	memset(spectrum_display_char_old, 0x9F, sizeof(spectrum_display_char_old));
	spectrum_display_char[sizeof(spectrum_display_char) - 1] = 0x00;
	spectrum_display_char_old[sizeof(spectrum_display_char_old) - 1] = 0x00;

	spectrum_get_delay = 20;
	spectrum_display_delay = 1;

	while (thread_data->stop == 0)
	{
		start_clock = clock();

		if (play_info->is_new_track == true)
		{
			if (cfg_fadein_speed != 0)
			{
				scroll_pos = SCROLL_LINE1_SIZE - 1;
			}
			else
			{
				scroll_pos = 0;
			}
			scroll_delay_count = cfg_fadein_speed;
			scroll_delay_move = cfg_fadein_speed;
			play_info->is_new_track = false;
		}

		if (scroll_delay_count + code_exec_time < scroll_delay_move)
		{
			scroll_delay_count += code_exec_time;
		}
		else
		{
			if (play_info->str_line1_avaliable == true && (play_info->play_state == PLAY_STATE_PLAY || play_info->play_state == PLAY_STATE_PAUSE))
			{
				scroll_delay_count = 0;
				if (scroll_pos > 0)
				{
					scroll_delay_move = cfg_fadein_speed;
				}
				else if (scroll_pos == 0)
				{
					scroll_delay_move = cfg_scroll_wait;
				}
				else
				{
					if (display_get_utf8_len(play_info->str_line_1, 0) > SCROLL_LINE1_SIZE)
					{
						if (cfg_scroll_speed == 0 && (-scroll_pos % (display_get_utf8_len(play_info->str_line_1, 1) + 1)) == 0)
						{
							scroll_delay_move = -1;
							continue;
						}
						else if (cfg_scroll_speed != 0)
						{
							scroll_delay_move = cfg_scroll_speed;
						}
						else
						{
							scroll_delay_move = SCROLL_DEFAULT_SPEED;
						}
					}
					else
					{
						scroll_delay_move = -1;
						continue;
					}
				}
				display_scroll_utf8(play_info->str_line_1, scroll_pos, sizeof(scroll_str) / 3, scroll_str, sizeof(scroll_str));
				if (disable_display == false)
				{
					display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', scroll_str);
				}
				scroll_pos -= 1;
			}
		}

		if (play_info->update_str_line2 == true)
		{
			if (disable_display == false && volume_delay_count <= 0)
			{
				display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', play_info->str_line_2);
				play_info->update_str_line2 = false;
			}
		}

		if (play_info->update_volume == true)
		{
			if (cfg_onvolume_hold > 0)
			{
				volume_delay_count = cfg_onvolume_hold;
				memset(volume_str, '\0', sizeof(volume_str));
				for (i = 0; i < strlen(cfg_onvolume_string2); i++)
				{
					if (i < sizeof(volume_str) - 1)
					{
						volume_str[i] = cfg_onvolume_string2[i];
					}
					else
					{
						break;
					}
				}
				if (play_info->volume <= -100.0)
				{
					play_info->volume = -99.99;
				}
				snprintf(&volume_str[i], sizeof(volume_str) - i, "%+06.2fdB", (double)play_info->volume);
				display_draw_utf8(hid, VOLUME_START_X, VOLUME_START_Y, 0, VOLUME_LINE_SIZE, ' ', volume_str);
			}
			play_info->update_volume = false;
		}
		if (volume_delay_count - code_exec_time > 0)
		{
			volume_delay_count -= code_exec_time;
		}
		else if (volume_delay_count >= 0)
		{
			volume_delay_count = -1;
			if (play_info->play_state != PLAY_STATE_STOP)
			{
				play_info->update_str_line2 = true;
			}
			else
			{
				play_info->update_play_state = true;
			}
		}

		if (play_info->update_play_state == true)
		{
			switch (play_info->play_state)
			{
			case PLAY_STATE_STOP:
				disable_display = false;
				if (cfg_onstop_power <= 3)
				{
					display_set_power(hid, 1);
					display_set_dim(hid, cfg_onstop_power);
				}
				else if (cfg_onstop_power == 4)
				{
					display_set_power(hid, 1);
					display_clear_screen(hid);
					disable_display = true;
					break;
				}
				else if (cfg_onstop_power == 5)
				{
					display_set_power(hid, 0);
				}
				display_set_cp_user(hid);
				display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_STOP);
				display_set_cp_utf8(hid);
				if (*cfg_onstop_string1 != '\0')
				{
					display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', cfg_onstop_string1);
				}
				else
				{
					display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', scroll_str);
				}
				if (*cfg_onstop_string2 != '\0')
				{
					display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', cfg_onstop_string2);
				}
				else
				{
					if (play_info->str_line2_avaliable == true)
					{
						display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', play_info->str_line_2);
					}
				}
				memset(scroll_str, '\0', sizeof(scroll_str));
				break;
			case PLAY_STATE_PLAY:
				if (cfg_onplay_power <= 3)
				{
					display_set_power(hid, 1);
					display_set_dim(hid, cfg_onplay_power);
					if (disable_display == true)
					{
						display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', scroll_str);
						if (play_info->str_line2_avaliable == true)
						{
							display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', play_info->str_line_2);
						}
						disable_display = false;
					}
				}
				else if (cfg_onplay_power == 4)
				{
					display_set_power(hid, 1);
					display_clear_screen(hid);
					disable_display = true;
					break;
				}
				else if (cfg_onplay_power == 5)
				{
					display_set_power(hid, 0);
				}
				display_set_cp_user(hid);
				display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_PLAY);
				display_set_cp_utf8(hid);
				break;
			case PLAY_STATE_PAUSE:
				if (cfg_onpause_power <= 3)
				{
					display_set_power(hid, 1);
					display_set_dim(hid, cfg_onpause_power);
					if (disable_display == true)
					{
						display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', scroll_str);
						if (play_info->str_line2_avaliable == true)
						{
							display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', play_info->str_line_2);
						}
						disable_display = false;
					}
				}
				else if (cfg_onpause_power == 4)
				{
					display_set_power(hid, 1);
					display_clear_screen(hid);
					disable_display = true;
					break;
				}
				else if (cfg_onpause_power == 5)
				{
					display_set_power(hid, 0);
				}
				display_set_cp_user(hid);
				display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_PAUSE);
				display_set_cp_utf8(hid);
				break;
			case PLAY_STATE_LOADING:
				if (disable_display == false)
				{
					display_set_cp_user(hid);
					display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_LOAD);
					display_set_cp_utf8(hid);
					if (*cfg_onload_string1 != '\0')
					{
						display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', cfg_onload_string1);
					}
					if (*cfg_onload_string2 != '\0')
					{
						display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', cfg_onload_string2);
					}
				}
				break;
			}
			play_info->update_play_state = false;
		}

		if (play_info->play_state != PLAY_STATE_STOP && volume_delay_count == -1)
		{
			if (spectrum_get_delay - code_exec_time > 0)
			{
				spectrum_get_delay -= code_exec_time;
			}
			else
			{
				spectrum_get_delay = 40;
				visualisation_stream_ptr->get_absolute_time(abs_time);
				if (visualisation_stream_ptr->get_spectrum_absolute(spectrum_chunk, abs_time, FFT_SIZE) == true)
				{
					// memset(spectrum_display_char, 0x00, sizeof(spectrum_display_char));
					memset(spectrum_visual_data, 0x00, sizeof(spectrum_visual_data));
					for (i = 0; i < FFT_SIZE - 2; i += spectrum_chunk.get_channels())
					{
						for (j = 0; j < spectrum_chunk.get_channels(); j++)
						{
							spectrum_visual_data[i / spectrum_chunk.get_channels()] += spectrum_chunk.get_data()[i + j];
						}
						spectrum_visual_data[i / spectrum_chunk.get_channels()] /= spectrum_chunk.get_channels();
					}
					for (i = 0; i < sizeof(spectrum_display_char) - 1; i++)
					{
						if (spectrum_display_char[i] < ((uint8_t)g_scale_value_single(spectrum_visual_data[FFT_SIZE / 2 / (sizeof(spectrum_display_char) - 1) * i], 15, true) + 0x90))
						{
							spectrum_display_char[i] = ((uint8_t)g_scale_value_single(spectrum_visual_data[FFT_SIZE / 2 / (sizeof(spectrum_display_char) - 1) * i], 15, true) + 0x90);
						}
					}
				}
			}
			if (spectrum_display_delay - code_exec_time > 0)
			{
				spectrum_display_delay -= code_exec_time;
			}
			else
			{
				spectrum_display_delay = 20;
				for (i = 0; i < sizeof(spectrum_display_char) - 1; i++)
				{
					if (spectrum_display_char[i] > spectrum_display_char_old[i])
					{
						spectrum_display_char_old[i] += 1;
					}
					else if (spectrum_display_char[i] < spectrum_display_char_old[i])
					{
						spectrum_display_char_old[i] -= 1;
					}
					else
					{
						//spectrum_display_char_old[i] = spectrum_display_char[i];
					}
				}
				display_set_cp_user(hid);
				display_draw_ascii(hid, 0, 1, 0, 20, ' ', spectrum_display_char_old);
				display_set_cp_utf8(hid);
			}
		}

