izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/display_thread.cpp
///* 直接从META或文件名获取当前轨道标题 */
//
//		const char* title_meta;
//		unsigned int title_meta_size;
//		metadb_handle_ptr metadb;
//		file_info_impl meta_info;
//
//		if (m_playback_control->get_now_playing(metadb) == true && metadb != NULL)
//		{
//			metadb->get_info(meta_info);
//			title_meta = meta_info.meta_get("TITLE", 0);
//			if (title_meta != NULL)
//			{
//				title_meta_size = strlen(title_meta);
//			}
//			else
//			{
//				title_meta = metadb->get_path();
//				title_meta = strrchr(title_meta, '\\') + 1;
//				title_meta_size = strchr(title_meta, '.') - title_meta;
//			}
//			strncpy_s(play_info.title, title_meta, sizeof(play_info.title));
//			play_info.title_avaliable = 1;
//			if (m_playback_control->is_paused() == true)
//			{
//				play_info.play_state = 2;
//			}
//			else
//			{
//				play_info.play_state = 1;
//			}
//		}


///* 直接获取获取正在播放的文件信息，不使用foobar格式化功能，仅在正在播放时有效 */
//metadb_handle_ptr metadb;
//file_info_impl meta_info;
//const char* codec;
//if (m_playback_control->get_now_playing(metadb) == true && metadb != NULL)
//{
//	if (metadb->is_info_loaded() == true)
//	{
//		metadb->get_info(meta_info);
//		play_info.bitrate = meta_info.info_get_int("bitrate");
//		play_info.samplerate = meta_info.info_get_int("samplerate");
//		codec = meta_info.info_get("codec");
//		if (strlen(codec) >= sizeof(play_info.str_codec))
//		{
//			memcpy(play_info.str_codec, codec, sizeof(play_info.str_codec) - 1);
//		}
//		else
//		{
//			memcpy(play_info.str_codec, codec, strlen(codec));
//		}
//	}
//	else
//	{
//		strncpy_s(play_info.str_codec, u8"----", sizeof(play_info.str_codec)); /* 文件解码失败 */
//	}

//旧测试显示
//if (playback_info_callback->play_info.volume != play_info.volume)
//{
//	play_info.volume = playback_info_callback->play_info.volume;
//	if (play_info.volume > -100.0)
//	{
//		snprintf(volume_str, sizeof(volume_str), "%06.2fdB", play_info.volume);
//	}
//	else
//	{
//		snprintf(volume_str, sizeof(volume_str), "%06.1fdB", play_info.volume);
//	}
//	//display_draw_utf8(hid, 0, 1, 0, 8, volume_str);
//	OutputDebugString(L"Update Volume\r\n");
//}
//if (playback_info_callback->play_info.play_state != play_info.play_state || playback_info_callback->play_info.playback_time != play_info.playback_time || playback_info_callback->play_info.track_length != play_info.track_length)
//{
//	play_info.play_state = playback_info_callback->play_info.play_state;
//	if (playback_info_callback->play_info.playback_time != play_info.playback_time || playback_info_callback->play_info.track_length != play_info.track_length)
//	{
//		play_info.playback_time = playback_info_callback->play_info.playback_time;
//		play_info.track_length = playback_info_callback->play_info.track_length;
//		time[0] = (unsigned char)(play_info.playback_time / 60.0);
//		time[1] = (unsigned char)(play_info.playback_time - time[0] * 60);
//		snprintf(time_str, sizeof(time_str), "%02d:%02d", time[0], time[1]);
//	}
//	if (play_info.play_state == 0)
//	{
//		snprintf(time_str, sizeof(time_str), "%02d:%02d", 0, 0);
//	}
//	if (play_info.play_state == 2)
//	{
//		display_set_cp_user(hid);
//		display_draw_utf8(hid, 0, 0, 0, 2, u8"\x81 ");
//		display_set_cp_utf8(hid);
//	}
//	else if (play_info.play_state == 1)
//	{
//		display_draw_utf8(hid, 0, 0, 0, 2, u8"▷ ");
//	}
//	display_draw_utf8(hid, 15, 1, 0, 5, time_str);
//	OutputDebugString(L"Update Time\r\n");
//}
//if (memcmp(playback_info_callback->play_info.str_line_1, play_info.str_line_1, sizeof(play_info.str_line_1)) != 0)
//{
//	memcpy(play_info.str_line_1, playback_info_callback->play_info.str_line_1, sizeof(play_info.str_line_1));
//	display_clear_line(hid, 0);
//	if (play_info.play_state == 1)
//	{
//		display_draw_utf8(hid, 0, 0, 0, 2, u8"▷ ");
//	}
//	else if (play_info.play_state == 0)
//	{
//		display_set_cp_user(hid);
//		display_draw_utf8(hid, 0, 0, 0, 2, u8"\x80 ");
//		display_set_cp_utf8(hid);
//		display_draw_utf8(hid, 2, 0, 0, 18, u8"已停止。");
//	}
//	else if (play_info.play_state == 3)
//	{
//		display_draw_utf8(hid, 0, 0, 0, 2, u8"▷ ");
//		display_draw_utf8(hid, 2, 0, 0, 18, u8"正在加载...");
//	}
//	if (play_info.str_line_1[0] != '\0')
//	{
//		display_draw_utf8(hid, 2, 0, 0, 18, play_info.str_line_1);
//		display_draw_utf8(hid, 0, 1, 0, 5, u8"     ");
//		display_draw_utf8(hid, 0, 1, 0, 5, playback_info_callback->play_info.str_codec);
//		snprintf(samplerate_str, sizeof(samplerate_str), "%04.1fk", playback_info_callback->play_info.samplerate / 1000.0);
//		display_draw_utf8(hid, 5, 1, 0, 6, u8"      ");
//		display_draw_utf8(hid, 5, 1, 0, 6, samplerate_str);
//	}
//	OutputDebugString(L"Update Title\r\n");
//}

// 初次使用的格式化字符串
// u8"%codec% $div(%samplerate%,1000).$div($sub(%samplerate%,$mul($div(%samplerate%,1000),1000)),100)k $padcut_right($ifgreater($div(%playback_time_seconds%,60),99,99,$div(%playback_time_seconds%,60)),2,0):$ifgreater($div(%playback_time_seconds%,60),99,++,$padcut_right($sub(%playback_time_seconds%,$mul($div(%playback_time_seconds%,60),60)),2,0))
// u8"%title%"

//在主线程内获取信息
//service_ptr_t <get_playback_info> playback_info_callback = new service_impl_t<get_playback_info>();
//static_api_ptr_t<main_thread_callback_manager> callback_manager;
//struct get_playback_info : main_thread_callback
//{
//public:
//	std::atomic<bool> thread_done;
//	const char* formatter_input_line1;
//	const char* formatter_input_line2;
//	PlayInfo play_info;
//	virtual void callback_run()
//	{
//		thread_done = false;
//		memset(&play_info, 0x00, sizeof(struct PlayInfo));
//
//		/* 使用格式化功能输出第一行自定义字符串，仅在正在播放时有效 */
//		if (formatter_input_line1 != NULL)
//		{
//			static_api_ptr_t<titleformat_compiler>()->compile_safe_ex(formatter_script, formatter_input_line1);
//			if (m_playback_control->playback_format_title(NULL, formatter_str, formatter_script, NULL, playback_control::display_level_all) == true)
//			{
//				formatter_str_len = strlen(formatter_str);
//				if (formatter_str_len >= sizeof(play_info.str_line_1))
//				{
//					memcpy(play_info.str_line_1, formatter_str, sizeof(play_info.str_line_1) - 1);
//				}
//				else
//				{
//					memcpy(play_info.str_line_1, formatter_str, formatter_str_len);
//				}
//			}
//		}
//		/* 使用格式化功能输出第二行自定义字符串，仅在正在播放时有效 */
//		if (formatter_input_line2 != NULL)
//		{
//			static_api_ptr_t<titleformat_compiler>()->compile_safe_ex(formatter_script, formatter_input_line2);
//			if (m_playback_control->playback_format_title(NULL, formatter_str, formatter_script, NULL, playback_control::display_level_all) == true)
//			{
//				formatter_str_len = strlen(formatter_str);
//				if (formatter_str_len >= sizeof(play_info.str_line_2))
//				{
//					memcpy(play_info.str_line_2, formatter_str, sizeof(play_info.str_line_2) - 1);
//				}
//				else
//				{
//					memcpy(play_info.str_line_2, formatter_str, formatter_str_len);
//				}
//			}
//		}
//		/* 获取播放状态 */
//		if (m_playback_control->get_now_playing(metadb) == true && metadb->is_info_loaded() == true)
//		{
//
//			if (m_playback_control->is_paused() == true)
//			{
//				play_info.play_state = PLAY_STATE_PAUSE; /* 暂停 */
//			}
//			else
//			{
//				play_info.play_state = PLAY_STATE_PLAY; /* 正在播放 */
//			}
//		}
//		else
//		{
//			if (m_playback_control->is_playing() == true)
//			{
//				play_info.play_state = PLAY_STATE_LOADING; /* 正在加载 */
//			}
//			else
//			{
//				play_info.play_state = PLAY_STATE_STOP; /* 停止 */
//			}
//		}
//		/* 获取音量 */
//		play_info.volume = m_playback_control->get_volume();
//		/* 线程完成 */
//		thread_done = true;
//	}
//private:
//	static_api_ptr_t<playback_control> m_playback_control;
//	titleformat_object::ptr formatter_script;
//	pfc::string_formatter formatter_str;
//	uint32_t formatter_str_len;
//	metadb_handle_ptr metadb;
//	file_info_impl file_info;
//};

